In [1]:
import pandas as pd

# Reading Text File

In [2]:
mydata = pd.read_table('mydata.txt', sep = ' ', header = None)
mydata.columns = ['Gender', 'Age', 'Height', 'Weight']
mydata.head()

  Gender  Age  Height  Weight
0      M   50      68     155
1      F   23      60     101
2      M   65      72     220
3      F   35      65     133
4      M   15      71     166

# Reading CSV File

In [3]:
mydata = pd.read_csv('mydata.csv', header = None)
# mydata.columns = ['Gender', 'Age', 'Height', 'Weight']
mydata.head()

   0   1   2    3
0  M  50  68  155
1  F  23  60  101
2  M  65  72  220
3  F  35  65  133
4  M  15  71  166

# Reading Excel File

In [4]:
wages = pd.read_excel('wages.xls')
wages.head()

  Subject       Date  Hours Worked  Rate Per Hour     Wage
0     M12 2006-12-12            40          15.25   610.00
1     F34 2006-11-16            35          25.57   894.95
2     M76 2006-06-03            10          54.00   540.00
3     F87 2006-04-06            45          35.00  1575.00
4    M122 2006-08-04            40          35.00  1400.00

# Reading JSON File

In [5]:
mydata = pd.read_json('mydata.json', orient = 'records')
mydata.columns = ['Gender', 'Age', 'Height', 'Weight']
mydata.head()

  Gender  Age  Height  Weight
0      M   50      68     155
1      F   23      60     101
2      M   65      72     220
3      F   35      65     133
4      M   15      71     166